Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འདུས་པ་འདི་ལྟ་བུ་འདི་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་འདུས་པ་འདི་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། མི་དང་། མི་མ་ཡིན་པ་འདུས་པ་འདི་ལྟ་བུ་ནི་དཀོན་ནོ།
en: It is rare to find such a congregation of the blessed buddhas, bodhisattva great beings, śakras, brahmās, world protectors, and lords of the gods, nāgas, yakṣas, gandharvas, and so forth, as well as human and nonhuman beings!

source: །དེ་བས་ན་ད་ཁྱོད་ཀྱིས་འདི་མཐོང་ནས། སངས་རྒྱས་ཀྱི་ཞིང་འདིར་མ་འོངས་པའི་དུས་ན་དམ་པའི་ཆོས་འདི་དང་། ཆོས་ཀྱི་ཚུལ་འདི་ཡོངས་སུ་བསྐྱང་བ་དང་། དཀོན་མཆོག་གསུམ་གྱི་རིགས་འདི་འབར་བར་བྱེད་པར་སྤྲོ་བ་དག་གིས།
en: Therefore, now that you have seen this, may those of you who are happy to sustain this sacred Dharma—this Dharma method—and propagate the lineage of the Three Jewels in the future in this buddha field each make an aspiration before the Blessed One.”

source: དེ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྤྱན་སྔར་ཁྱེད་སོ་སོ་ནས་རང་རང་གི་སྨོན་ལམ་ཐོབ་ཤིག །ཡང་དེའི་ཚེ་བདུད་དགེ་སྦྱོང་མེ་ཏོག་ཅེས་བྱ་བ་ས་མེ་ཏོག་དང་། འབྲས་བུ་དང་། ལོ་ཏོག་དང་། མྱུ་གུ་སྣ་ཚོགས་ཀྱིས་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་བྲེ་བོ་བྱུར་བུར་བཀང་སྟེ། བུད་མེད་ཀྱི་གཟུགས་ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པར་བསྒྱུར་ནས།
en: At that time a māra named Flower Mendicant filled a bucket made of the seven precious substances to the brim with flowers, fruits, crops, and sprouts and transformed himself into a buxom lady with a fine complexion.

source: བུད་མེད་ཀྱི་གོས་དང་། རྒྱན་མཆོག་གིས་བརྒྱན་ཏེ། འདི་སྐད་ཅེས་གསོལ་ཏོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་སུ་དག་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་བྱོན་ཏེ་བཞུགས་པ་ཐམས་ཅད་དང་། གང་གཞན་ཡང་སུ་དག་འདིར་འདུས་པ་ཐམས་ཅད་བདག་ལ་དགོངས་སུ་གསོལ།
en: Dressed in women’s clothing and adorned with fine jewelry, the māra said, “All of you blessed buddhas who have come to this buddha field and now abide within it, and all the rest of you who have gathered here, please give me your attention!

source: བདག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ལ་མེ་ཏོག་དང་། འབྲས་བུ་དང་། ལོ་ཏོག་དང་། མྱུ་གུ་ཐམས་ཅད་ཀྱིས་བྱུར་བུར་ཡོངས་སུ་བལྟམས་ཤིང་རྒྱས་པའི་བྲེ་བོ་འདི་འབུལ་ན་སེམས་ཅན་ཐམས་ཅད་ལ་ཐུགས་བརྩེ་བར་དགོངས་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱིས་བདག་གི་བྲེ་བོ་མེ་ཏོག་དང་། འབྲས་བུ་དང་། ལོ་ཏོག་དང་། མྱུ་གུ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བལྟམས་པ་འདི་བཞེས་སུ་གསོལ།
en: As I offer this wide cauldron filled to the brim with all manner of flowers, fruits, crops, and sprouts to all the blessed buddhas, out of compassion for all beings please accept this bucket filled with all manner of flowers, fruits, crops, and sprouts.

source: འདི་ལྟར་བདག་བསྐལ་པ་བཟང་པོ་མཐའ་དག་ལ་སངས་རྒྱས་ཀྱི་ཞིང་མ་ལུས་པ་འདིར་བུད་མེད་ཀྱི་གཟུགས་ཀྱིས། སེམས་ཅན་རྣམས་ལ་ཟས་དང་། སྐོམ་དང་། འབྲས་བུ་དང་། མེ་ཏོག་དང་། ལོ་ཏོག་གི་སྦྱིན་པའི་བདག་པོར་འགྱུར་བར་བགྱི།
en: In this way I will then become a female benefactor in every buddha field without exception throughout the entire Fortunate Eon, one who provides others with food, drink, fruits, and flowers.

source: དེ་དག་ཀྱང་ཡོངས་སུ་སྨིན་པར་བགྱི།
en: I will bring them to maturity too.

source: བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པ་དེས་བདག་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བགྱི།
en: Through this ripening of merit, I will complete the six perfections and fully awaken to unsurpassed and perfect buddhahood.

source: སེམས་ཅན་གང་དག་བདག་གིས་འདུལ་བ་དེ་དག་ཀྱང་། ཡོ་བྱད་ཀྱིས་མི་བྲེལ་བར་བདག་གིས་རིམ་གྲོ་བགྱི་ན།
en: The beings I train will never lack supplies, and I will serve them well.

source: བདག་གི་བསམ་པ་རྣམས་ཡོངས་སུ་རྫོགས་པར་དངོས་གྲུབ་སྩལ་དུ་གསོལ།
en: Toward that end, please bestow, right now, the accomplishment that fulfills my wishes.”

source: དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །སྐྱེས་བུ་དམ་པ་ཁྱོད་འདི་ལྟར་སེམས་མངོན་པར་དད་པས་སྦྱིན་པ་ཆེ་ཞིང་མཐོ་བ་བྱས་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་ལ་ཁྱོད་ཀྱིས་མཆོད་པ་བྱས་པ་ལེགས་སོ་ལེགས་སོ།
en: Then all the blessed buddhas said, “Sublime being, it is excellent that, out of such faith, you have performed such an excellent and lofty act of generosity and venerated all the buddhas.

source: །ཁྱོད་ཀྱི་བྲེ་བོ་མེ་ཏོག་དང་། འབྲས་བུས་ཡོངས་སུ་གང་བ་འདི་ཡང་བཞེས་སོ།
en: We accept your cauldron filled with flowers and fruits.

source: །ཁྱོད་ཀྱང་མེ་ཏོག་དང་། འབྲས་བུ་དང་། འབྲུ་དང་། ལོ་ཏོག་ལ་སོགས་པ་ཇི་ལྟར་འདོད་པ་དང་། ཇི་ཙམ་འདོད་པ་དང་། གང་གི་ཕྱིར་འདོད་པ་རྙེད་པར་གྱུར་ཅིག །ཁྱོད་ཀྱི་རེ་བ་ཡིད་ཀྱི་བརྣག་པ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག །མེ་ཏོག་དང་། འབྲས་བུ་དང་། འབྲུ་ཕུན་སུམ་ཚོགས་པ་གྲུབ་པར་གྱུར་ཅིག །འབྱོར་པ་ཡང་ཕུན་སུམ་ཚོགས་པར་གྱུར་ཅིག །དེ་ནས་བདུད་དགེ་སྦྱོང་མེ་ཏོག་གིས་ཡང་གསོལ་པ།
en: You shall find all the flowers, fruits, grains, or crops that you wish for. Simply by bringing your wish to mind, it will be fulfilled. May you possess an abundance of flowers, fruits, and grains. May you have abundant wealth.” The māra Flower Mendicant spoke again:

source: གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། རི་བྲགས་གང་དག་ན་བདུད་ཀྱི་ཚོགས་ཀྱིས་མི་ཐུབ་པའི་གཟུངས་འདི་འཆང་ངམ། སྟོན་ཏམ། འཆད་དམ། གླེགས་བམ་ལ་བྲིས་ཏེ། བསྟི་སྟང་བགྱི་བའི་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། རི་བྲགས་དེ་དག་ཏུ་བདག་གནས་པར་བགྱིའོ།
en: “Whether in villages, towns, cities, or border towns, I will be anywhere this dhāraṇī, which the hosts of Māra cannot defeat, is held, taught, explained, or written down.

source: །དེ་དང་དེ་དག་ཏུ་ཤིང་ལྗོན་པ་རྣམས་ཀྱི་མེ་ཏོག་དང་། འབྲས་བུ་ནས་འབྲུ་དང་། ལོ་ཏོག་གི་བར་དུ་བསྒྲུབ་པར་བགྱིའོ།
en: I will ensure the success of everything from the flowers and fruits of their trees to their grain and harvests.

source: །དེ་དག་ཐམས་ཅད་ན་མེ་ཏོག་དང་། འབྲས་བུ་འཚལ་བའི་སེམས་ཅན་རྣམས་ཀྱང་ཚིམ་པར་བགྱིའོ།
en: I will satisfy all the beings who desire flowers and fruits in those places.

source: །བཅོམ་ལྡན་འདས་དེ་བས་ན། ཚེ་བས་པ་མ་གཏོགས་པར་གལ་ཏེ་དེ་ན་སེམས་ཅན་མེ་ཏོག་དང་། འབྲས་བུའི་ཟས་འཚལ་བ་འགའ་ཞིག་མེ་ཏོག་དང་འབྲས་བུའི་ཟས་མ་འཚལ་བའི་སླད་དུ། འགུམ་པའི་དུས་བགྱིད་པར་གྱུར་ན། དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་དང་། འདུས་པ་ཆེན་པོ་མ་ལུས་པ་འདི་བདག་གིས་བསླུས་པར་གྱུར་གྱིས་བདག་ཀྱང་།
en: Therefore, blessed ones, except in the case of active violence, if there comes a time when there is a being in such a place who dies for want of the flowers and fruits that they desired, then I have deceived all the blessed buddhas in the three times and this great assembly.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མ་གྱུར་ཅིག །གང་ཡང་དེ་ན་སེམས་ཅན་རྣམས་མེ་ཏོག་དང་། འབྲས་བུ་འཚལ་བ་དེ་ནི་བདག་གི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པའི་རྒྱུར་འགྱུར་རོ།
en: In that case, may I not fully awaken to unsurpassed and perfect buddhahood. “Any being there who desires flowers and fruits will be the cause of my completing the perfection of generosity.

source: །བཅོམ་ལྡན་འདས་དེ་ན་མེ་ཏོག་དང་འབྲས་བུ་དེ་དག་འཚལ་ནས་གང་སེམས་ཅན་དེ་དག་གཅིག་ལ་གཅིག་ཕན་པ་དང་། མཉེན་པ་དང་། སྙིང་རྗེ་བའི་སེམས་སུ་འགྱུར་བ་དེ་ནི་བདག་གི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པའི་རྒྱུར་འགྱུར་རོ།
en: Blessed ones, having desired flowers and fruits, should any of those beings have an altruistic, amiable, or compassionate attitude toward one another, that will be the cause of my completing the perfections of discipline and patience.

source: །གང་མེ་ཏོག་དང་། འབྲས་བུ་འཚལ་ནས། བརྩོན་འགྲུས་དང་ལྡན་པར་འགྱུར་བ་དེ་ནི། དེ་དག་གི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པའི་རྒྱུར་འགྱུར་རོ།
en: Should any of them come to practice diligence, having desired flowers and fruits, that will be the cause of my completing the perfection of diligence.

source: །གང་སེམས་དང་སེམས་ལས་བྱུང་བ་དག་ལ་མི་རྟག་པའི་འདུ་ཤེས་འཇུག་པ་དེ་ནི་བདག་གིས་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པའི་རྒྱུར་འགྱུར་རོ།
en: If they develop the perception that the mind and mental states are impermanent, that will be the cause of my completing the perfection of concentration.

source: །གང་མེ་ཏོག་དང་། འབྲས་བུ་འཚལ་ནས་ཐ་ན་བྱ་དང་རི་དགས་ཀྱང་ཆོས་འཚལ་བར་གྱུར་ཅིང་སྟོང་པ་ཉིད་ལ་གནས་ན་དེ་ནི་བདག་གི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པའི་རྒྱུར་འགྱུར་རོ།
en: If, having desired flowers and fruits, even birds or wild animals should come to desire the Dharma and abide in emptiness, that will be the cause of my completing the perfection of insight.

source: །གཞན་ཡང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གང་དུ་འབྱུང་བ་དེར་སེམས་ཅན་རྣམས་ཀྱི་འབྲས་དང་། གྲོ་དང་། ནས་དང་། ཏིལ་དང་། མོན་སྲན་སྡེའུ་དང་། མོན་སྲན་གྲེའུ་དང་། རྒྱ་སྲན་དང་། སྲན་ཆུང་དང་། སྲན་མ་དང་། གང་དག་ལོ་ཏོག་ཏུ་གྱུར་པ་དེ་དག་འཚལ་བའི་སླད་དུ་བདག་གིས་ནན་ཏན་ཆེར་བགྱིའོ།
en: Moreover, wherever this Dharma teaching spreads, I will assiduously grant everyone whatever crop they desire, be it fruit, wheat, barley, sesame, white lentils, black lentils, peas, horse gram, red lentils, or beans.

source: །འབྲུ་དང་ལོ་ཏོག་མང་པོ་དག་གིས་ཀྱང་མཛོད་དང་། བང་བ་ཐམས་ཅད་ཡོངས་སུ་བལྟམ་པར་བགྱིའོ།
en: I will fill all treasuries and granaries with all kinds of grains and harvests.

source: །དེ་ན་སེམས་ཅན་གང་ཐ་ན་བྱ་དང་རི་དགས་དག་གིས་ཀྱང་འཚལ་བར་གྱུར་ན། དེ་ནི་བདག་གི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པའི་རྒྱུར་འགྱུར་རོ།
en: Should even birds or wild animals desire anything, that will be the cause of my completing the perfection of insight.

source: །དེར་བདག་གི་བུ་རམ་ཤིང་དང་། རྒུན་འབྲུམ་དང་། བལ་པོ་སེའུའི་ཁུ་ཤུགས་ཤིན་ཏུ་མང་པོ་བསྒྲུབ་པར་བགྱིའོ།
en: I will ensure there is plenty of sugarcane, grapes, and pomegranate plants there.

source: །དེར་བདག་གིས་སེམས་ཅན་རྣམས་ཀྱི་རྫ་མ་དང་། བུམ་པ་དང་། བྱ་སྐྱོགས་རྣམས་ཡོངས་སུ་བལྟམ་པར་བགྱིའོ། །གང་དེ་ལ་ཐ་ན་བྱ་དང་རི་དགས་ལ་སོགས་པས་འཚལ་ན་ཡང་དེ་ནི་བདག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དུ་ཡོངས་སུ་རྫོགས་པའི་རྒྱུར་འགྱུར་ཏེ།
en: I will fill all the beings’ pots, vases, and ladles. When even birds or wild animals desire something, that will be the cause of my completing the perfections up to insight.

source: དེ་ལྟར་བདག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དེ་དག་ཡོངས་སུ་རྫོགས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བགྱིས།
en: Having completed the six perfections in this manner, I will fully awaken to unsurpassed and perfect buddhahood.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་ཀྱིས་བདག་གི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་འདི་ལྟ་བུ་འདི་ལ་རྗེས་སུ་དགྱེས་པར་མཛད་དུ་གསོལ།
en: All of you blessed buddhas and bodhisattva great beings, I request you to take delight in this, my bodhisattva conduct.”

source: དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱིས་ཅང་མི་གསུང་བར་གྱུར་པས་གནང་བ་མཛད་དོ།
en: The blessed buddhas expressed their approval by remaining silent.

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཏོག་ཅེས་བྱ་བས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །སྐྱེས་བུ་དམ་པ་ཁྱོད་འདི་ལྟ་བུའི་མཐུ་ཆེན་པོ་བྱེད་ནུས་ཀྱིས།
en: The thus-gone Jñānaketu then declared, “Sublime being, you will be able to enact this great power.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱི་སྟོབས་དང་། བརྩོན་འགྲུས་དང་། སྤྲོ་བ་དང་། རྟུལ་བ་དེ་ལྟ་བུས་སེམས་ཅན་ཐམས་ཅད་གཉེར་བར་གྱིས་ཤིག །དེ་ནས་བདུད་དགེ་སྦྱོང་མེ་ཏོག་གིས།
en: Sublime being, do look after all beings with that kind of strength, diligence, enthusiasm, and gentleness.”

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཏོག་དེ་ལས་དབུགས་འབྱིན་པ་དེ་ཐོས་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བདག་ལ་དགོངས་སུ་གསོལ།
en: When the māra Flower Mendicant heard this encouragement from the thus-gone Jñānaketu, he said, “Blessed buddhas, please give me your attention.

source: གང་ལ་ལ་ཞིག་ན། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མི་སྤྱོད་པ་དེར་བ་དག་མི་གནས་ཀྱི། གང་ལ་ལར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྤྱོད་པ་དེར་བ་དག་གནས་ཏེ། ས་ཕྱོགས་དེ་ན་འབྲུ་དང་། སྨན་དང་། འབྲས་བུ་དང་། མེ་ཏོག་གང་དག་འབྱུང་བ་དེ་དག་སེམས་ཅན་རྣམས་ཀྱི་ལོངས་སྤྱོད་དང་། ཀུན་སྤྱོད་པའི་སླད་དུ། རབ་ཏུ་སྣུམ་བག་ཅན་དང་། ཤིན་ཏུ་ཆེ་བ་དང་། ཤིན་ཏུ་མང་བ་དང་། ཤིན་ཏུ་རོ་བདའ་བ་དང་། ཤིན་ཏུ་ཡོངས་སུ་ཁ་དོག་དང་ལྡན་པར་བསྒྲུབ་པར་བགྱི།
en: I will not dwell where this Dharma teaching is not practiced, but only wherever it is practiced. I will ensure that all the grain, herbs, fruits, and flowers that exist in that place are resplendent, bountiful, plentiful, delicious, and colorful, so that people may savor them and enjoy them.

source: སེམས་ཅན་དེ་དག་ཀྱང་བཟའ་བ་དང་། བཏུང་བས་ཚིམ་པར་བགྱི།
en: I will satisfy people there with food and drink.

source: སེམས་ཅན་རྣམས་ཀྱི་མཛོད་དང་། བང་བ་དང་། བུམ་པ་དང་། རྫ་མ་དང་། བྱ་སྐྱོགས་རྣམས་ཤིན་ཏུ་ཡོངས་སུ་བལྟམ་པར་བགྱི།
en: I will fill their treasuries, granaries, pots, vases, and ladles.

source: ཐ་ན་གང་བྱ་དང་། རི་དགས་ཀྱིས་དེ་ལ་འཚལ་ཀྱང་།
en: Should even the birds or wild animals desire something, that will be the cause of my completing the perfection of insight.

source: དེ་ནི་བདག་གི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པའི་རྒྱུར་འགྱུར་བ་དང་། བདག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་བསྐལ་པ་སྟོང་ཐམས་ཅད་དུ། སེམས་ཅན་རྣམས་ལ་ཟས་དང་སྐོམ་གྱི་ལོངས་སྤྱོད་འདི་ལྟ་བུ་དག་གིས་ཚིམ་པར་བགྱི།
en: I will satisfy the beings here in this buddha field for a thousand eons with food and drink.

source: དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་དུ་གྱུར་པ་སྙིགས་མ་ལྔ་དང་ལྡན་པར་གྱུར་པ་གྲངས་མ་མཆིས་དཔག་ཏུ་མ་མཆིས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་རྣམས་སུ་བསྐལ་པ་སྟོང་རེ་རེ་ལ་ཡང་། སྐྱེས་བུའི་མཐུ་ཆེན་པོ་འདི་ལྟ་བུ་བགྱི་ཞིང་།
en: Likewise, I will perform this great power for a thousand eons in each and every one of the infinite, countless buddha fields, as numerous as the grains of sand in the Gaṅgā, that are afflicted and ripe with the five degenerations.

source: དེ་ནས་གདོད་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བགྱི་ན།
en: Then, as I fully awaken to unsurpassed and perfect buddhahood, all my deeds shall be perfected.

source: བདག་གི་ལས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བར་དངོས་གྲུབ་སྩལ་དུ་གསོལ།
en: Please bestow upon me this accomplishment.

source: བཅོམ་ལྡན་འདས་འདི་དག་ནི་རང་གི་སྨོན་ལམ་གྱིས་འགུགས་པའི་གསང་སྔགས་ཀྱི་ཚིག་ལགས་སོ། །འདི་ལྟ་སྟེ། ཙ་མེ་ཁ།
en: Blessed ones, the following mantra effects summoning according to one’s personal aspiration:

source: ཙ་མེ་ཁ། ཙ་མེ་ཁ། བི་བྲི་ཏ་ཧ་ཏེ། བ་ཧ་བ་ཧ་བ་ཧ། སྨ་ར་ཨསྨ་ར་ཀཱ་ནུ། ས་ར་ཊེ། བི་བ་བ་ས་བེ། ས་ར་ས་ར། ཨིན་དྲེ། ས་ར་མ་ཧཱི་ན་དྲེ། ས་ར་བཛྲེན་དྲེ། ཏ་ར་བཛྲེན་དྲེ། ཏ་ར་པ་ཡ་ཨསྨ་ཀ་ན། ཧུ་ཧུ་ཧུ། ཧུ་ཧུ་ཧུ། ཨ་སང་ག་ཛ་བེ། ཧ་ཁ་ཁ་བ་ཡུ་བ་ཧེ། ཨུ་པ་ན་ཡ། སན་ཏ་ར་བ་ཡ། བི་ཛ་ཕ་ལ་པུཥྤ། ཨོ་ཥ་དྷི། དྷ་ན་དྷ་ནྱེ་ན་ཙན་དྲ་ཨ་ཀྵ་ཡེ། ཛ་ལ་བ་ཧ་ནེ། སྨ་ར་ཨསྨ་ར་ཀན། སཾ་མྱག་པྲ་ཏི་པན་ན་པ་ཡ་ས་ཊ་ཏ་ཀཱ་ལི།
en: camekha camekha camekha vivritahate vaha vaha vaha smara asmarakān sarate vivavasave sara sara indre sara mahīndre sara vajrendre tara vajrendre tarapaya asmakan hu hu hu hu hu hu asaṅgajave ta kha kha vayuvahe upanaya santarpaya vijaphala­puṣpa oṣadhi dhana­dhanyena­candra akṣaye jalavahane smara asmarakan samyak pratipanna­payasaṭatakāli yama me mam imam edacavara svāhā

source: ཡ་མ་མེ། མ་མི་མ་མེད་ཙ་བ་ར་སྭཱ་ཧཱ། བཅོམ་ལྡན་འདས་བདག་ཡོངས་སུ་སྨིན་པར་བགྱི་བ་དང་། བྱང་ཆུབ་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བའི་སླད་དུ། གང་དང་གང་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དང་། གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་བཤད་པ་དེ་དང་དེ་དག་ཏུ་བདག་གནས་པར་བགྱིའོ། །དེ་ནས་ཡང་དེའི་ཚེ།
en: “Blessed ones, may I abide wherever this Dharma teaching and mantra are spoken, in order to bring beings to maturity and perfect my bodhisattva conduct.”

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱིས་དེ་ལ་ལེགས་སོ། །ཞེས་བྱ་བ་བྱིན་ནོ།
en: The blessed buddhas all expressed their approval to him.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་དང་། བདུད་ཀྱི་འཁོར་དང་བཅས་པ་དེ་དག་ཐམས་ཅད་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་ཐམས་ཅད་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། གྲུལ་བུམ་དང་། ཤ་ཟ་དང་། མི་དང་མི་མ་ཡིན་པ་དེ་དག་ཐམས་ཅད་དང་། སངས་རྒྱས་ཀྱི་ཞིང་འདིར་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་མགྲིན་གཅིག་ཏུ་ལེགས་སོ། །ཞེས་བྱ་བ་བྱིན་ཏེ། སྐྱེས་བུ་དམ་པ་ཁྱོད་བུད་མེད་ཀྱི་གཟུགས་ཀྱིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་སྤྱོད་པ་ལེགས་སོ་ལེགས་སོ།
en: All the bodhisattva great beings, Māra and his entire retinue, the śakras, the brahmās, and all the world protectors, as well as all the gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, kumbhāṇḍas, piśācas, and human and nonhuman beings in this buddha field expressed their approval with one voice, saying, “Sublime being, it is excellent that you bring beings to maturity in the form of a woman and engage in the six perfections.

source: །ཁོ་བོ་ཅག་གི་བསོད་ནམས་དང་། བརྩོན་འགྲུས་དང་། སྟོབས་དང་། ཕ་རོལ་གནོན་པས་སྐྱེས་བུའི་མཐུ་འདི་ལྟ་བུ་མངོན་པར་གྲུབ་པར་འགྱུར་རོ།
en: May we all achieve this kind of power through our own merit, diligence, strengths, and bravery!”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །སྐྱེས་བུ་དམ་པ་འདིའི་གྲོགས་བྱེད་པར་སྙིང་བརྩེ་བ་ཅན་དུ་སྤྲོའོ།
en: The thus-gone Śākyamuni then said, “May you be joyful supporters who assist this sublime being.”

source: །དེ་ནས་བདུད་དགེ་སྦྱོང་མེ་ཏོག་གི་འཁོར་གང་ཡིན་པ་དེས་མགྲིན་གཅིག་ཏུ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བདག་ཅག་འདིའི་སླད་བཞིན་དུ་འབྲང་ཞིང་མཛའ་བ་དང་། རྗེས་སུ་འཐུན་པའི་གྲོགས་བགྱིའོ།
en: The entirety of the māra Flower Mendicant’s retinue then declared with one voice, “For this purpose, we will be this being’s followers, associates, and harmonious assistants.

source: །སྐྱེས་བུ་དམ་པ་ཁྱོད་ནམ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དེའི་ཚེ། ཁྱོད་ཀྱིས་བདག་ཅག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་ཅིག །བདུད་དགེ་སྦྱོང་མེ་ཏོག་གིས་སྨྲས་པ།
en: Sublime being, when you fully awaken to unsurpassed and perfect buddhahood, please bestow prophecies of our attaining unsurpassed and perfect awakening.”

source: བཞིན་བཟངས་དག་དེ་བཞིན་དུ་གྱུར་ཅིག །སེམས་ཅན་གང་དག་གིས་ས་ལ་ས་བོན་རྣམས་བཏབ་སྟེ།
en: “Friends, may this come to be!” agreed the māra Flower Mendicant.

source: མེ་ཏོག་དང་། འབྲས་བུ་དང་། དྲི་ཀུན་ཏུ་སྤྱོད་པར་གྱུར་པ་དེ་ཡང་བདག་ཅག་ལ་ཕན་པ་དང་བདེ་བར་གྱུར་ཅིག །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་བདུད་དགེ་སྦྱོང་མེ་ཏོག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: “When a being plants a seed in the earth and enjoys its flowers, fruit, and fragrance, may this bring us happiness and benefit!” The māra Flower Mendicant then addressed the thus-gone Śākyamuni:

source: །བདག་ནི་ཁྱོད་ཀྱི་བསྟན་པ་འཛིན་པ་ལགས་ཀྱི་ཆོས་ཀྱི་ཚུལ་འབར་བར་བགྱིད་པ་ལགས་ཏེ།
en: “I will uphold your teachings and spread your Dharma methods.

source: འདི་ཉིད་དུ་ཐོག་མར་མུ་གེའི་དགོན་པ་རབ་ཏུ་ཞི་བར་བགྱི་བའི་སླད་དུ།
en: First and foremost, I will assiduously apply myself to eradicating all calamities involving famine.

source: ནན་ཏན་ཆེར་བགྱིས། བཅོམ་ལྡན་འདས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་དུ་གསོལ།
en: Blessed One, please bestow a prophecy of unsurpassed and perfect awakening upon me.”

source: དེ་ནས་བདུད་དགེ་སྦྱོང་མེ་ཏོག་གིས། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་ཡན་ལག་ལྔས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: The māra Flower Mendicant then bowed to the thus-gone Śākyamuni, touching the five points of his body to the ground, and sat to one side.

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་བདུད་དགེ་སྦྱོང་མེ་ཏོག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The thus-gone Śākyamuni then said to him:

source: །བདེ་གཤེགས་སྲས་པོ་དཔའ་བོ་པད་མའི་གདོང་ལོངས་ཤིག །ཁྱོད་ཀྱིས་དེ་རིང་བྱང་ཆུབ་མཆོག་ཏུ་སྨོན་ལམ་སྙིང་པོ་བཏབ།
en: “Heroic heir of the blissful ones, O lotus face, stand! You have today made the essential aspiration to supreme awakening.

source: །རྩ་ལག་གཅིག་པུ་སྙིང་རྗེ་སྐྱེས་ཏེ་བཀྲེས་པའི་སྡུག་བསྔལ་གྱིས།
en: Arousing your compassion, sole kinsman, you will liberate beings tormented

source: །གཟིར་བའི་འགྲོ་བ་འདི་བཀྲོལ་ནས་ནི་སངས་རྒྱས་འགྲུབ་པར་འགྱུར།
en: By the suffering of hunger, and then you will accomplish buddhahood.

source: །ཆོས་རྣམས་རང་བཞིན་དྲི་མེད་དག་ལ་ནམ་མཁའ་འདྲ་བ་དང་། །སྟོང་ཉིད་མཚན་མ་རྣམས་དང་སྨོན་པའི་ཡུལ་ལས་རབ་གྲོལ་བར།
en: The nature of phenomena is that they are immaculate, just like space. They are emptiness and utterly transcend the domains of signs and wishes.

source: །རྟོགས་ནས་ཞིང་འདིར་རིང་པོར་མི་ཐོགས་དཔལ་ལྡན་ཞེས་བྱ་བའི།
en: Realizing this, you will soon become a buddha called Splendor—

source: །སངས་རྒྱས་དགྲ་ཐུལ་བློ་གྲོས་ཤིན་ཏུ་བསྟན་པ་ཉིད་དུ་འགྱུར།
en: A wise being who tames all enemies in this buddha field with his vast teaching.”

source: །དེ་ནས་བདུད་དགེ་སྦྱོང་མེ་ཏོག་མཆོག་ཏུ་དགའ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས། བཅོམ་ལྡན་འདས་དེ་དག་ལ་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་གཏོར་ཏོ། །ཡང་དེའི་ཚེ།
en: Extremely pleased and delighted, the māra Flower Mendicant cast a variety of flowers toward the blessed ones.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གྲུབ་པའི་བློ་གྲོས་ཞེས་བྱ་བ་སྟན་ལས་ལངས་ཏེ།
en: At that time, the bodhisattva great being Siddhimati rose from his seat.

source: ཐལ་མོ་སྦྱར་ནས། སངས་རྒྱས་ཀྱི་ཞིང་འདིར་གཏོགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་དབྱངས་ཀྱིས་གོ་བར་བྱས་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Joining his palms, he spoke in a clear voice to the blessed buddhas in this buddha field:

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བདག་ལ་དགོངས་སུ་གསོལ།
en: “Blessed buddhas, please give me your attention!

source: བསྐལ་པ་བཟང་པོ་བྱུང་ནས་བདག་གིས་དེ་བཞིན་གཤེགས་པ་འཁོར་བ་འཇིག་གི་སྤྱན་སྔར་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱི་བའི་སླད་དུ་སྨོན་ལམ་བཏབ་སྟེ།
en: Once, at the beginning of the Fortunate Eon, I made an aspiration before the thus-gone Krakucchanda so as to be able to bring beings to maturity.

source: སེམས་ཅན་རྣམས་ཀྱི་ནད་བརྒྱ་རྩ་བཞི་རབ་ཏུ་ཞི་བར་བགྱི་བའི་སླད་དུ། བུད་མེད་ཀྱི་གཟུགས་ཀྱིས་སའི་བཅུད་ལས་བྱིན་བླངས་ཏེ། རྩྭ་དང་རྩ་བ་སྣ་ཚོགས་ཀྱི་ནང་དུ་སྩལ་ཏོ། །སེམས་ཅན་རྣམས་ལོངས་སྤྱོད་དུ་བགྱི་བ་དང་། ནད་རབ་ཏུ་ཞི་བར་བགྱི་བའི་སླད་དུ། སྨན་བཅུད་ཀྱིས་ལེན་བརྒྱ་རྩ་བཞི་སྦྱར་ཏེ།
en: In a female form, I extracted the nectar of the earth by searching among herbs and roots in order to heal the four hundred and four illnesses. Thus, in order to make beings happy and free from illness, I demonstrated how to prepare one thousand and four sets of medicinal treatments.

source: །རྩ་བའི་སྨན་བརྒྱ་རྩ་བཞི་དང་། འབྲས་བུའི་སྨན་བརྒྱ་རྩ་བཞི་དང་། མར་ལས་སྦྱར་བ་བརྒྱ་རྩ་བཞི་དང་། འབྲུ་མར་ལས་སྦྱར་བ་བརྒྱ་རྩ་བཞི་དང་། བཀྲུ་སྨན་བརྒྱ་རྩ་བཞི་དང་། སྨན་ནད་མེད་ཅེས་བྱ་བ་བརྒྱ་རྩ་བཞི་ནས་བསྐ་བའི་ཕྱེ་མ་དང་། རིལ་བུ་དང་། སྣར་སྩལ་བའི་བར་དུ་སྟོང་རྩ་བཞི་བསྟན་ཏོ། །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱི་བ་དང་། ནད་ཞི་བར་བགྱི་བ་དང་། སེམས་ཅན་རྣམས་ལ་ཕན་པར་བགྱི་བའི་སླད་དུ་བདག་གིས་དེ་བཞིན་གཤེགས་པ་འཁོར་བ་འཇིག་ཞབས་འབྲིང་བ་དང་བཅས་པ་ལ་ཀུན་སྤྱད་པ་སྣ་ཚོགས་ཀྱིས་བསྙེན་བཀུར་བགྱིས་ནས།
en: These included four hundred and four medicinal extracts, four hundred and four herbal medicines, four hundred and four medicines made from fruits, four hundred and four applications made from butter, four hundred and four applications made from seed oil, four hundred and four cleansing treatments, four hundred and four medicines known as ‘good health,’ and so forth, as well as treatments ingested in the form of powders, pills, and aromas. In order to bring beings to maturity, heal their illnesses, and benefit them, I acted in various functions as the thus-gone Krakucchanda’s attendant, serving him, and from him sought a prophecy of unsurpassed and perfect awakening.

source: དེར་བ་དག་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་འཚལ་བ་དང་། དེ་ནས་དེ་བཞིན་གཤེགས་པ་འཁོར་བ་འཇིག་གིས་བདག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །མ་འོངས་པའི་དུས་ན། སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱ་ཐུབ་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཞེས་བྱ་བ་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཞེས་བྱ་བའི་བར་དང་ལྡན་པ་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་འབྱུང་ངོ་།
en: “The thus-gone Krakucchanda then declared to me, ‘In the future, when beings’ lifespan is a hundred years, there will be one called Śākyamuni who will be called a blessed, thus-gone, worthy, perfect buddha.

source: །དེ་བཞིན་གཤེགས་པ་དེའི་སྔོན་གྱི་སྨོན་ལམ་གྱིས་སངས་རྒྱས་འདུས་པ་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་འདུས་པ་ཆེན་པོ་འབྱུང་སྟེ།
en: From the previous aspirations of this thus-gone one, a great gathering of buddhas and bodhisattvas will manifest.

source: དེར་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཐོབ་པར་འགྱུར་རོ། །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་གསེར་ཐུབ་ཀྱིས་ཀྱང་དེ་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དེའི་འོག་ཏུ་འོད་སྲུང་གིས་ཀྱང་བདག་ལ་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: Then you will receive a prophecy of unsurpassed and perfect awakening.’ Later, this was mentioned by the thus-gone Kanakamuni and then by the thus-gone Kāśyapa as well.

source: དེའི་ཚེ་བདག་གིས་སེམས་ཅན་ནད་པ་རྣམས་ཀྱི་སླད་དུ། བསྐལ་པ་ཆེན་པོ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་བར་དུ། སངས་རྒྱས་ཀྱི་ཞིང་འདིར་སྨན་ཆེན་པོ་བཅུད་ཀྱིས་ལེན་གྱི་ལྷར་གྱུར་ཅིག །དེར་ཡང་བདག་གིས་སེམས་ཅན་ཀུན་སྤྱད་པ་དང་། ནད་རབ་ཏུ་ཞི་བར་བགྱི་བའི་སླད་དུ། སའི་བཅུད་རྒྱ་ཆེན་པོ་བླངས་ནས།
en: “And so I aspired, ‘At that time, may I become a great healer, a god who can extract for sick beings the essences in this buddha field for great eons as numerous as the grains of sand in the Gaṅgā.
